export const CARDS = [
  {
    heading: "Определение задачи и поиск решения",
    paragraphs: [
      { img: "chat", text: "Обсуждаем вашу задачу" },
      { img: "development", text: "Обследуем инфраструктуру разработки" },
      { img: "deal", text: "Предлагаем решение, озвучиваем сроки и стоимость" },
    ],
  },
  {
    heading: "Проработка решения",
    paragraphs: [
      { img: "write", text: "Подписываем договор" },
      {
        img: "site-map",
        text: "Создаем прототипы конвейера для сборки и конвейера для автоматического развёртывания",
      },
      { img: "chat2", text: "На основе работающих прототипов уточняем детали" },
    ],
  },
  {
    heading: "Внедрение решения",
    paragraphs: [
      { img: "coding", text: "Создаем стабильные версии обоих конвейеров" },
      {
        img: "settings",
        text: "Производим тонкую настройку и адаптируем конвейеры к новым требованиям",
      },
      { img: "paper-plane", text: "Передаем знания о внедренном решении" },
    ],
  },
  {
    heading: "Эксплуатация",
    hint: "в случае необходимости",
    paragraphs: [
      { img: "siren", text: "Оказываем техническую поддержку" },
      { img: "error", text: "Внедряем мониторинг, логирование и оповещения" },
      { img: "login", text: "Решаем проблемы масштабирования" },
    ],
  },
];

export const BUTTONS = [
  'Определение задачи и поиск решения',
  'Проработка решения',
  'Внедрение решения',
  'Эксплуатация'
] 